{
    "recipes": [
        {
            "id": 1,
            "recipeName": "Борщ",
            "national": 1,
            "type": 1,
            "description": "Сегодня в каждой семье есть свой рецепт борща. В кастрюлю добавляют и фасоль, и грибы, и копчёности, и даже сельдерей. Мы же научим вас готовить идеальный традиционный борщ.",
            "guide": "Для бульона:\r\n\r\n1½–2 л воды;\r\n400–500 г свинины или говядины на кости.\r\nДля зажарки:\r\n\r\n2 небольшие свёклы;\r\n1 средняя морковь;\r\n3 средние луковицы;\r\n4–5 столовых ложек растительного масла;\r\nщепотка лимонной кислоты, немного столового уксуса или ½ лимона;\r\n2 столовые ложки томатной пасты.\r\nДля борща:\r\n\r\n300 г свежей белокочанной капусты;\r\n4 средние картофелины;\r\nсоль — по вкусу;\r\n1–2 сушёных лавровых листа;\r\nзелень — по вкусу;\r\n1 зубчик чеснока — опционально;\r\nщепотка молотой гвоздики — опционально;\r\nщепотка молотого чёрного перца — опционально.\n\n1½–2 л воды;\r\n400–500 г свинины или говядины на кости.\r\nДля зажарки:\r\n\r\n2 небольшие свёклы;\r\n1 средняя морковь;\r\n3 средние луковицы;\r\n4–5 столовых ложек растительного масла;\r\nщепотка лимонной кислоты, немного столового уксуса или ½ лимона;\r\n2 столовые ложки томатной пасты.\r\nДля борща:\r\n\r\n300 г свежей белокочанной капусты;\r\n4 средние картофелины;\r\nсоль — по вкусу;\r\n1–2 сушёных лавровых листа;\r\nзелень — по вкусу;\r\n1 зубчик чеснока — опционально;\r\nщепотка молотой гвоздики — опционально;\r\nщепотка молотого чёрного перца — опционально.",
            "imagePath": "Images/borw",
            "cookingTime": 90,
            "ingredients": [
                {
                    "ingredient": {
                        "id": 3,
                        "ingredientName": "Свёкла"
                    },
                    "weight": 0.0
                },
                {
                    "ingredient": {
                        "id": 1,
                        "ingredientName": "Морковь"
                    },
                    "weight": 0.30000001192092898
                },
                {
                    "ingredient": {
                        "id": 6,
                        "ingredientName": "Репчатый лук"
                    },
                    "weight": 0.019999999552965165
                },
                {
                    "ingredient": {
                        "id": 44,
                        "ingredientName": "Масло"
                    },
                    "weight": 0.05000000074505806
                },
                {
                    "ingredient": {
                        "id": 53,
                        "ingredientName": "Картошка"
                    },
                    "weight": 0.30000001192092898
                },
                {
                    "ingredient": {
                        "id": 9,
                        "ingredientName": "Свинина"
                    },
                    "weight": 0.5
                },
                {
                    "ingredient": {
                        "id": 54,
                        "ingredientName": "Вода"
                    },
                    "weight": 2.0
                },
                {
                    "ingredient": {
                        "id": 2,
                        "ingredientName": "Капуста"
                    },
                    "weight": 0.30000001192092898
                }
            ]
        },
        {
            "id": 2,
            "recipeName": "Лазанья классическая с мясом",
            "national": 2,
            "type": 5,
            "description": "Лазанья – традиционное итальянское блюдо, представляющее собой пласты теста, переложенные различной начинкой. Считается, что как делать лазанью придумали жители провинции Эмилия-Романья.",
            "guide": "1. В сотейник положить сливочное масло и 2 ложки растительного масла, растопить. Постепенно добавлять муку и размешивать так, чтобы не оставалось комочков.\n2. Когда вся мука вмешана, влить все молоко. Убавить огонь и томить до нужной консистенции: не жидкой, но и не слишком густой. Консистенция нежирной сметаны.\n3. На сковороде раскалить оливковое масло. Добавить мясной фарш (лучше свинина+телятина).\n4. Фарш жарить до полуготовности. Влить в него соус болоньезе, посолить и поперчить по вкусу.\n5. Духовку разогреть до 180 градусов. Форму смазать сливочным маслом. На дно вылить немного соуса бешамель, чуть-чуть, только чтобы покрыть дно.\n6. Выложить пласты (не вареные). На пласты выложить получившийся фарш (не жалеем!), на фарш — натертый сыр. На сыр — соус бешамель.\n7. Соуса нужно выкладывать столько, сколько необходимо, на ваш взгляд, чтобы лазанья получилась сочной. Поверх соуса выложить сухие листы лазаньи. Повторить процедуру.\n8. Последний слой листов промазать соусом бешамель и сверху щедро засыпать сыром. Дать постоять минут 7–10. Поставить в духовку. Печь 30 минут.",
            "imagePath": "Images/lazanya-s-myasom",
            "cookingTime": 40,
            "ingredients": [
                {
                    "ingredient": {
                        "id": 5,
                        "ingredientName": "Фарш"
                    },
                    "weight": 0.6
                },
                {
                    "ingredient": {
                        "id": 46,
                        "ingredientName": "Сливочное масло"
                    },
                    "weight": 0.06
                },
                {
                    "ingredient": {
                        "id": 42,
                        "ingredientName": "Молоко"
                    },
                    "weight": 0.75
                },
                {
                    "ingredient": {
                        "id": 55,
                        "ingredientName": "Пшеничная мука"
                    },
                    "weight": 0.05
                },
                {
                    "ingredient": {
                        "id": 45,
                        "ingredientName": "Масло оливковое"
                    },
                    "weight": 0.05
                },
                {
                    "ingredient": {
                        "id": 56,
                        "ingredientName": "Соус Болоньезе"
                    },
                    "weight": 0.6
                },
                {
                    "ingredient": {
                        "id": 57,
                        "ingredientName": "Листья для лазаньи"
                    },
                    "weight": 10.0
                },
                {
                    "ingredient": {
                        "id": 58,
                        "ingredientName": "Твердый сыр"
                    },
                    "weight": 0.5
                }
            ]
        },
        {
            "id": 3,
            "recipeName": "Ризотто с шампиньонами",
            "national": 2,
            "type": 5,
            "description": "Ризотто с грибами считается классикой итальянской кухни. Грибы — лишь один из вариантов дополнений к рису, наряду с морепродуктами, но, на наш взгляд, самый гармоничный. За правильную бархатистую, кремообразную текстуру ризотто отвечает круглый рис, который отличается высоким содержанием крахмала. А сливочное масло и тертый твердый сыр (в оригинале пармезан) доводят задумку до совершенства. ",
            "guide": "1. Лук мелко нарезать и обжаривать в сотейнике на сливочном масле до тех пор, пока лук не начнет пахнуть жареным, добавить мелко нарезанные шампиньоны, обжарить их, пока не выпустят воду. Тогда всыпать в сотейник рис и обжаривать его вместе с луком и грибами две минуты, постоянно помешивая.\n2. Залить рис и лук куриным бульоном и вином. Варить без крышки, постоянно помешивая. Когда бульон и вино выпарятся наполовину, добавить крошечную щепотку шафрана, посолить. Помешивая, варить, пока рис не приготовится. Если жидкость выкипит слишком рано, долить воды, вина или бульона.",
            "imagePath": "Images/risotto",
            "cookingTime": 40,
            "ingredients": [
                {
                    "ingredient": {
                        "id": 77,
                        "ingredientName": "Рис аброрио"
                    },
                    "weight": 0.3
                },
                {
                    "ingredient": {
                        "id": 46,
                        "ingredientName": "Сливочное масло"
                    },
                    "weight": 0.1
                },
                {
                    "ingredient": {
                        "id": 6,
                        "ingredientName": "Репчатый лук"
                    },
                    "weight": 0.08
                },
                {
                    "ingredient": {
                        "id": 78,
                        "ingredientName": "Белое сухое вино"
                    },
                    "weight": 0.2
                },
                {
                    "ingredient": {
                        "id": 79,
                        "ingredientName": "Куриный бульон"
                    },
                    "weight": 1.0
                },
                {
                    "ingredient": {
                        "id": 70,
                        "ingredientName": "Шафран"
                    },
                    "weight": 0.005
                },
                {
                    "ingredient": {
                        "id": 40,
                        "ingredientName": "Шампиньоны"
                    },
                    "weight": 0.3
                }
            ]
        },
        {
            "id": 4,
            "recipeName": "Сырники",
            "national": 1,
            "type": 8,
            "description": "Главный секрет идеальных сырников — а точнее творожников, — творог нужно протереть через мелкое сито и отжать от влаги. Жирность предпочтительна не больше и не меньше 9%. Тесто должно получиться эластичным, чтобы при надавливании сырник не треснул на сковородке, а сохранил форму. Если все сделать правильно, получатся нежные однородные кругляшки под плотной румяной корочкой. Сырники можно запекать в духовке или готовить на пару. В рецепте не исключаются эксперименты с начинкой — сухофрукты, орехи, свежие фрукты и даже картофель лишними не будут. Приятного аппетита!",
            "guide": "1. Положите весь творог в кастрюльку и разомните его вилкой так, чтобы в нем не осталось крупных комков. Разбейте в него яйца, всыпьте сахар и тщательно все перемешайте. Лучше не использовать слишком сухой или слишком влажный творог, иначе сырники будут разваливаться в процессе приготовления.\n2. Всыпьте в творог 5 столовых ложек (с горкой) муки и тщательно перемешайте. Можно добавить немного больше муки, сырники получатся тогда более плотными. Или муки можно добавить чуть меньше, и тогда сырники будут нежнее. В итоге у вас должна получиться однородная масса, из которой можно будет лепить сырники.\n3. Поставьте сковороду на средний огонь и налейте в нее подсолнечное масло.\n4.  Насыпьте на тарелку немного муки. Слепите несколько небольших шариков из получившейся творожной массы и положите их на тарелку. Лучше лепить разом 4–5 шариков — столько, сколько поместится одновременно на сковороду. Затем по очереди обкатывайте творожные шарики в муке, плющите их в небольшие лепешки (они не должны быть слишком тонкие) и выкладывайте на сковороду.\n5. Обжаривайте сырники 1–2 минуты до появления золотистой корочки. Затем переверните их на другую сторону и также обжарьте до золотистого состояния.\n6. Повторяйте, пока творог не закончится.",
            "imagePath": "Images/syrniki",
            "cookingTime": 30,
            "ingredients": [
                {
                    "ingredient": {
                        "id": 54,
                        "ingredientName": "Творог"
                    },
                    "weight": 0.5
                },
                {
                    "ingredient": {
                        "id": 44,
                        "ingredientName": "Масло подсолнечное"
                    },
                    "weight": 0.125
                },
                {
                    "ingredient": {
                        "id": 37,
                        "ingredientName": "Сахар"
                    },
                    "weight": 0.05
                },
                {
                    "ingredient": {
                        "id": 30,
                        "ingredientName": "Куриное яйцо"
                    },
                    "weight": 0.1
                },
                {
                    "ingredient": {
                        "id": 55,
                        "ingredientName": "Пшеничная мука"
                    },
                    "weight": 0.15
                }
            ]
        },
        {
            "id": 5,
            "recipeName": "Американский тыквенный пирог с корицей",
            "national": 9,
            "type": 3,
            "description": "Тыквенный пирог с корицей — классика застолья Среднего и прочего Запада, анекдотический персонаж американского быта не лишен, однако, прелести, особенно если не получать его с младых ногтей каждые два дня в качестве десерта. Тыква тоже имеет звание чуть ли не коренного жителя Америки, так как открыта была именно здесь и охотно используется жителями континента во многих блюдах по многим случаям. И все же этот пирог получается безумно вкусным, если выбрать правильную тыкву — удлиненную, с закругленным концом.",
            "guide": "1. Просеять муку и соль в глубокую миску. Перетереть между ладоней с мягким маслом, чтобы смесь напоминала хлебные крошки, затем добавить слегка взбитое яйцо и замесить тесто. Скатать его в шар, завернуть в пленку и отправить в холодильник на 30–50 минут.\n2. Очистить тыкву, удалить семена. Нарезать мякоть кубиками. Положить в кастрюлю с толстым дном или сотейник, добавить немного воды и тушить до мягкости и полного испарения жидкости. Блендером измельчить мякоть в однородную массу. Для пущей нежности получившееся пюре можно протереть через сито.\n3. Раскатать тесто на слегка присыпанной мукой поверхности и застелить им круглую низкую форму диаметром около 30 см. Поверх теста положить лист бумаги для запекания и засыпать любую крупу. Это позволит коржу равномерно пропечься. Выпекать в течение 15 минут при 190 градусах.\n4. Выложить тыквенное пюре в глубокую миску, взбить с двумя яйцами, сахаром, сливками, пряностями и солью. Вылить смесь в форму с запеченным тестом. Выпекать пирог 50–55 минут при 180 градусах. Когда пирог остынет, его можно смело разрезать на порции.",
            "imagePath": "Images/pumpkin",
            "cookingTime": 60,
            "ingredients": [
                {
                    "ingredient": {
                        "id": 30,
                        "ingredientName": "Куринное яйцо"
                    },
                    "weight": 0.1
                },
                {
                    "ingredient": {
                        "id": 37,
                        "ingredientName": "Сахар"
                    },
                    "weight": 0.2
                },
                {
                    "ingredient": {
                        "id": 43,
                        "ingredientName": "Сливки"
                    },
                    "weight": 0.2
                },
                {
                    "ingredient": {
                        "id": 46,
                        "ingredientName": "Сливочное масло"
                    },
                    "weight": 0.25
                },
                {
                    "ingredient": {
                        "id": 59,
                        "ingredientName": "Тыква"
                    },
                    "weight": 0.9
                },
                {
                    "ingredient": {
                        "id": 60,
                        "ingredientName": "Корица"
                    },
                    "weight": 0.01
                }
            ]
        },
        {
            "id": 6,
            "recipeName": "Тосканский салат",
            "national": 2,
            "type": 2,
            "description": "Тосканский салат, выдержанный в колористике итальянского флага. Буквально нескольких ложек хватает, чтобы в желудке образовалась приятная тяжесть. Очень полезная штука с точки зрения утра, когда трудно запихнуть в себя крупные дозы биомассы, а есть при этом хочется. Кроме рукколы в этом салате уверенно чувствуют себя листья корн-салата и щавеля, но идеальнее всего ведет себя зеленая черемша.",
            "guide": "1. Вскрыть две банки красной фасоли в собственном соку, слить сок и промыть фасоль холодной водой. Желающие использовать не баночную, а самостоятельно сваренную фасоль должны задуматься о приготовлении этого салата еще с вечера. Сначала замочить бобы на ночь, а потом варить их на медленном огне до готовности.\n2. Готовую фасоль смешать с мелко нарубленным красным луком, зеленью, например, рукколы (которую для удобства поедания нужно предварительно изорвать руками), давленым чесноком, оливковым маслом, лимонным соком и творожным сыром.\n3. Посолить, поперчить, дать продуктам две минуты притереться друг к другу и подавать к столу вместе с бокалом Nobile di Montepulciano, если вино осталось с вечера.",
            "imagePath": "Images/toskansii_recept",
            "cookingTime": 60,
            "ingredients": [
                {
                    "ingredient": {
                        "id": 23,
                        "ingredientName": "Перец черный"
                    },
                    "weight": 0.01
                },
                {
                    "ingredient": {
                        "id": 26,
                        "ingredientName": "Лимон"
                    },
                    "weight": 0.2
                },
                {
                    "ingredient": {
                        "id": 45,
                        "ingredientName": "Масло оливковое"
                    },
                    "weight": 0.05
                },
                {
                    "ingredient": {
                        "id": 22,
                        "ingredientName": "Чеснок"
                    },
                    "weight": 0.01
                },
                {
                    "ingredient": {
                        "id": 61,
                        "ingredientName": "Консервированная фасоль"
                    },
                    "weight": 0.4
                },
                {
                    "ingredient": {
                        "id": 62,
                        "ingredientName": "Рукола"
                    },
                    "weight": 0.1
                },
                {
                    "ingredient": {
                        "id": 63,
                        "ingredientName": "Творожный сыр"
                    },
                    "weight": 0.2
                },
                {
                    "ingredient": {
                        "id": 64,
                        "ingredientName": "Красный лук"
                    },
                    "weight": 0.05
                }
            ]
        },
        {
            "id": 7,
            "recipeName": "Оякодон",
            "national": 3,
            "type": 8,
            "description": "Оякодон — разновидность традиционного японского блюда донбури, представляющего собой круглую чашу с рисом, дополненную различными ингредиентами, от куска свинины или говядины до угря. Если верить источникам, оякодон придумали в Осаке около 1900 года, бросив на рис кусочки курицы с весенним луком и залив их яйцом. Название блюда, к слову, буквально означает на японском «мать и дитя». Кстати, готовить оякодон можно не только с курицей, с говядиной тоже вкусно. И еще это не только завтрак — он может быть и обедом, и ужином.",
            "guide": "1. Репчатый лук очистить и нарезать тонкими полукольцами. На среднем огне разогреть сковороду и влить в нее шесть столовых ложек соевого соуса.\n2. Как только соевый соус начнет кипеть, бросить в сковороду луковые полукольца и посыпать сверху сахаром. Готовить, периодически помешивая, две-три минуты.\n3. Тем временем куриное филе нарезать небольшими кусочками — сильно измельчать мясо не нужно, готовые ломтики должны остаться сочными и плотными.\n4. Положить курицу в сковороду и перемешать с соусом. Когда мясо побелеет с одной стороны, перевернуть аккуратно ломтики и потушить еще пару минут. Куриное филе готовится удивительно быстро: максимум три-четыре минуты.\n5. В отдельной миске вилкой или венчиком быстро взбить яйца в однородную смесь. Добавлять соль при этом не нужно — соевый соус, в котором тушится мясо, и так достаточно солон.\n6. Вылить яичную смесь на сковороду, стараясь равномерно покрыть все мясо. Накрыть сковороду крышкой и готовить омлет три-четыре минуты, не мешая, пока яйца как следует не схватятся.\n7. Зеленый лук измельчить. На сервировочную тарелку выложить горкой теплый рис, сваренный на пару.\n8. Сверху на рис аккуратно выложить омлет — для удобства его можно разделить лопаткой на треугольные сегменты. Посыпать оякодон измельченным зеленым луком — и подавать горячим.",
            "imagePath": "Images/oyakodon",
            "cookingTime": 30,
            "ingredients": [
                {
                    "ingredient": {
                        "id": 6,
                        "ingredientName": "Репчатый лук"
                    },
                    "weight": 0.1
                },
                {
                    "ingredient": {
                        "id": 7,
                        "ingredientName": "Зеленый лук"
                    },
                    "weight": 0.02
                },
                {
                    "ingredient": {
                        "id": 10,
                        "ingredientName": "Рис"
                    },
                    "weight": 0.25
                },
                {
                    "ingredient": {
                        "id": 30,
                        "ingredientName": "Куриное яйцо"
                    },
                    "weight": 0.01
                },
                {
                    "ingredient": {
                        "id": 37,
                        "ingredientName": "Сахар"
                    },
                    "weight": 0.05
                },
                {
                    "ingredient": {
                        "id": 65,
                        "ingredientName": "Соевый соус"
                    },
                    "weight": 0.15
                },
                {
                    "ingredient": {
                        "id": 66,
                        "ingredientName": "Куриное филе"
                    },
                    "weight": 0.3
                }
            ]
        },
        {
            "id": 8,
            "recipeName": "Томатный суп с морепродуктами",
            "national": 6,
            "type": 1,
            "description": "Томатный суп с морепродуктами – это невероятно вкусное, а главное простое блюдо для каждого, даже самого искушенного дегустатора. Приготовить такое блюда не составит никакого труда, даже самому молодому и начинающему повару.",
            "guide": "1. Замороженные морепродукты выложить в глубокую миску и залить кипятком. Оставить на пять-семь минут, затем откинуть на дуршлаг и обсушить. Переложить в кастрюлю, залить 500 мл воды и поставить на средний огонь.\n2. Тем временем в сковороде разогреть столовую ложку растительного масла и поджарить на нем измельченные лук и чеснок до золотистого цвета. Получившуюся поджарку добавить в кастрюлю с морепродуктами.\n3. Помидор и сладкий болгарский перец нарезать небольшими кубиками. Кинуть в ту же сковороду, где готовились лук и чеснок, и быстро поджарить, постоянно помешивая, в течение пары минут, не дольше.\n4. Добавить поджаренные овощи в кастрюлю. Перемешать суп, довести до кипения. Слегка посолить и бросить несколько горошин черного перца.\n5. Влить томатный сок. Добавить шафран, смесь прованских трав (в хорошую прованскую смесь входят базилик, орегано, розмарин, чабер и тимьян) и сушеный базилик. Снова довести суп до кипения.\n6. Выжать в кастрюлю примерно столовую ложку лимонного сока. Помешать и дать супу покипеть еще минут пять-семь. Тем временем в небольшой миске взбить яйца.\n7. Тоненькой струйкой влить в кипящий суп взбитые яйца, непрерывно помешивая жидкость ложкой. Снять кастрюлю с огня, накрыть крышкой и оставить на пять минут.\n8. Готовый суп слегка остудить и разлить по тарелкам. Каждую порцию супа можно дополнительно посыпать черным молотым перцем и сбрызнуть лимонным соком.",
            "imagePath": "Images/tomatnyi_sup",
            "cookingTime": 30,
            "ingredients": [
                {
                    "ingredient": {
                        "id": 6,
                        "ingredientName": "Репчатый лук"
                    },
                    "weight": 0.1
                },
                {
                    "ingredient": {
                        "id": 22,
                        "ingredientName": "Чеснок"
                    },
                    "weight": 0.03
                },
                {
                    "ingredient": {
                        "id": 10,
                        "ingredientName": "Рис"
                    },
                    "weight": 0.25
                },
                {
                    "ingredient": {
                        "id": 30,
                        "ingredientName": "Куриное яйцо"
                    },
                    "weight": 0.02
                },
                {
                    "ingredient": {
                        "id": 67,
                        "ingredientName": "Морепродукты"
                    },
                    "weight": 0.25
                },
                {
                    "ingredient": {
                        "id": 68,
                        "ingredientName": "Сладкий перец"
                    },
                    "weight": 0.06
                },
                {
                    "ingredient": {
                        "id": 17,
                        "ingredientName": "Томат"
                    },
                    "weight": 0.05
                },
                {
                    "ingredient": {
                        "id": 69,
                        "ingredientName": "Томатный сок"
                    },
                    "weight": 0.35
                },
                {
                    "ingredient": {
                        "id": 70,
                        "ingredientName": "Шафран"
                    },
                    "weight": 0.005
                },
                {
                    "ingredient": {
                        "id": 31,
                        "ingredientName": "Базилик"
                    },
                    "weight": 0.005
                },
                {
                    "ingredient": {
                        "id": 71,
                        "ingredientName": "Прованские травы"
                    },
                    "weight": 0.005
                },
                {
                    "ingredient": {
                        "id": 72,
                        "ingredientName": "Лимонный сок"
                    },
                    "weight": 0.025
                }
            ]
        },
        {
            "id": 9,
            "recipeName": "Гуакамоле",
            "national": 8,
            "type": 12,
            "description": "Гуакамоле как закуска, — или как соус, кому что ближе — традиционно известна в мексиканской кухне, но очень популярна во всем мире. Главное, найти хороший спелый авокадо и непременно размять мякоть с соком лимона или лайма — с этим нехитрым действием блюдо сохраняет свой зеленый цвет и не превращается в нечто непривлекательное. Консистенция же может быть разной: если разминать вилкой, получится закуска с кусочками ингредиентов, если смешать все в блендере — соус, который отлично подойдет ко многим основным блюдам.",
            "guide": "1. Помидоры очистить и мелко нарезать. Чили избавить от семян и измельчить вместе с луком, чесноком и кинзой. В большой ступке пестиком превратить чили, кинзу, помидоры и цедру лайма и лук в однородную пасту. Слегка посолить и снова перемешать.\n2. Добавить одну-две столовые ложки воды и сок лайма, чтобы смесь стала более жидкой.\n3. Очистить авокадо, удалить косточки, нарезать мякоть небольшими кубиками. Добавить к пасте из чили и помидоров и тщательно все размять. Подавать с кукурузными чипсами. ",
            "imagePath": "Images/guakomole",
            "cookingTime": 30,
            "ingredients": [
                {
                    "ingredient": {
                        "id": 6,
                        "ingredientName": "Репчатый лук"
                    },
                    "weight": 0.1
                },
                {
                    "ingredient": {
                        "id": 22,
                        "ingredientName": "Чеснок"
                    },
                    "weight": 0.01
                },
                {
                    "ingredient": {
                        "id": 17,
                        "ingredientName": "Томат"
                    },
                    "weight": 0.25
                },
                {
                    "ingredient": {
                        "id": 73,
                        "ingredientName": "Перец чили"
                    },
                    "weight": 0.25
                },
                {
                    "ingredient": {
                        "id": 74,
                        "ingredientName": "Авокадо"
                    },
                    "weight": 0.7
                },
                {
                    "ingredient": {
                        "id": 75,
                        "ingredientName": "Кинза"
                    },
                    "weight": 0.1
                },
                {
                    "ingredient": {
                        "id": 76,
                        "ingredientName": "Лайм"
                    },
                    "weight": 0.3
                }
            ]
        },
        {
            "id": 10,
            "recipeName": "Хычины с картофелем и сыром",
            "national": 7,
            "type": 3,
            "description": "Хычины – традиционная выпечка народов Кабардино-Балкарии. Щедро смазанные маслом, нежные и мягкие они особенно вкусны горячими.",
            "guide": "1. Смешать муку, молоко, воду, сахар, соль и дрожжи, месить тесто до тех пор, пока оно не перестанет прилипать к рукам. Сформировать шар, оставить его отдохнуть минимум на полчаса.\n2. Пропустить через мясорубку отварной картофель и сыры, перемешать массу до однородного состояния.\n3. Разделить тесто на восемь частей, скатать каждую в шарик, раскатать каждый шарик до размера десертного блюдца. Взять один раскатанный блинчик, выложить на него начинку, накрыть сверху вторым блинчиком, слепить края и заново раскатать получившийся пирог в тонкий блин размером со сковородку диаметром порядка 30 см.\n4. Обжарить хычин на раскаленной сухой сковороде. Сначала с одной стороны, пока пирог не начнет надуваться. Проткнуть пузырь зубочисткой, выпустить воздух и перевернуть хычин на другую сторону.\n5. Смазать тарелку топленым сливочным маслом, выложить хычин, также промазать сверху маслом. Разрезать на несколько куском-клиньев и подавать.",
            "imagePath": "Images/xychiny",
            "cookingTime": 60,
            "ingredients": [
                {
                    "ingredient": {
                        "id": 55,
                        "ingredientName": "Пшеничная мука"
                    },
                    "weight": 0.26
                },
                {
                    "ingredient": {
                        "id": 42,
                        "ingredientName": "Молоко"
                    },
                    "weight": 0.1
                },
                {
                    "ingredient": {
                        "id": 80,
                        "ingredientName": "Вода"
                    },
                    "weight": 0.05
                },
                {
                    "ingredient": {
                        "id": 37,
                        "ingredientName": "Сахар"
                    },
                    "weight": 0.005
                },
                {
                    "ingredient": {
                        "id": 38,
                        "ingredientName": "Соль"
                    },
                    "weight": 0.006
                },
                {
                    "ingredient": {
                        "id": 81,
                        "ingredientName": "Сухие дрожжи"
                    },
                    "weight": 0.003
                },
                {
                    "ingredient": {
                        "id": 82,
                        "ingredientName": "Отварной картофель"
                    },
                    "weight": 0.2
                },
                {
                    "ingredient": {
                        "id": 83,
                        "ingredientName": "Сыр сулугуни"
                    },
                    "weight": 0.16
                },
                {
                    "ingredient": {
                        "id": 84,
                        "ingredientName": "Имперетинский сыр"
                    },
                    "weight": 0.04
                },
                {
                    "ingredient": {
                        "id": 85,
                        "ingredientName": "Топленое масло"
                    },
                    "weight": 0.01
                }
            ]
        },
        {
            "id": 11,
            "recipeName": "Фахитас с курицей и фасолью",
            "national": 8,
            "type": 4,
            "description": "Фахитас — традиционное мексиканское блюдо, схожее с буррито. Но, в отличие от буррито, где начинка заворачивается в лепешку-тортилью, фахитас подается раздельно, и каждый сам решает, что именно положить в лепешку.",
            "guide": "1. В разогретом масле обжарить нарезанный болгарский перец.\n2. Добавить нарезанное кубиками куриное филе, слегка обжарить его.\n3. Добавить нарезанный перец чили и консервированную в соусе чили фасоль.\n4. Закрыть крышкой и тушить до готовности в течение 10 минут. Подавать с лавашом и сметаной.",
            "imagePath": "Images/faxitas",
            "cookingTime": 30,
            "ingredients": [
                {
                    "ingredient": {
                        "id": 66,
                        "ingredientName": "Куриное филе"
                    },
                    "weight": 1.0
                },
                {
                    "ingredient": {
                        "id": 61,
                        "ingredientName": "Консервированная фасоль"
                    },
                    "weight": 0.3
                },
                {
                    "ingredient": {
                        "id": 68,
                        "ingredientName": "Сладкий перец"
                    },
                    "weight": 0.3
                },
                {
                    "ingredient": {
                        "id": 73,
                        "ingredientName": "Перец чили"
                    },
                    "weight": 0.2
                },
                {
                    "ingredient": {
                        "id": 44,
                        "ingredientName": "Масло подсолнечное"
                    },
                    "weight": 0.02
                }
            ]
        },
        {
            "id": 12,
            "recipeName": "Брауни с темным шоколадом",
            "national": 9,
            "type": 7,
            "description": "Брауни с горьким шоколадом — знаменитый десерт американской кухни, который покорил своим ароматом и насыщенным шоколадным вкусом. Он станет отличным дополнением к чашке чая или кофе, а также хорошим украшением праздничного стола.",
            "guide": "1. На водяной бане, помешивая, растопите масло и шоколад. Ни в коем случае не дайте масляно-шоколадной смеси закипеть. Нам нужно только темперировать шоколад, но не перегреть его. Как только масло и шоколад сольются воедино, снимите смесь с огня и дайте остыть.\n2. В отдельной миске взбейте яйца с сахаром в течение 3 минут, пока смесь не побелеет и не вспенится.\n3. Добавьте в яичную смесь остывшую смесь масла с шоколадом.\n4. Перемешайте все до получения однородной массы.\n5. Просейте в смесь муку с разрыхлителем и аккуратно вмешайте ее резиновой спатулой лишь до того момента, как перестанут быть видны белые разводы в толще смеси.\n6. Разогрейте духовку до 180 градусов. Перелейте смесь в прямоугольную форму.\n7. Выпекайте брауни примерно 20 минут. Их всегда лучше недопечь, чем перепечь, потому что во втором случае мы потеряем невероятный шоколадный аромат и ту самую слегка влажную внутреннюю консистенцию, которыми так знамениты брауни и за которые так сильно любимы. Поскольку они продолжают готовиться и после того, как вы достали форму из духовки, лучше прекращать готовить брауни, когда брауни слегка запеклись с краев, но еще подрагивают в середине.\n8. Переложите брауни из формы на разделочную доску (это будет проще сделать, если провести ножом между краем формы и краем брауни, а потом, приложив доску к форме, перевернуть форму и позволить брауни самим вывалиться на доску. Далее с помощью второй доски еще раз переворачиваем.",
            "imagePath": "Images/brauni",
            "cookingTime": 20,
            "ingredients": [
                {
                    "ingredient": {
                        "id": 46,
                        "ingredientName": "Сливочное масло"
                    },
                    "weight": 0.15
                },
                {
                    "ingredient": {
                        "id": 37,
                        "ingredientName": "Сахар"
                    },
                    "weight": 0.3
                },
                {
                    "ingredient": {
                        "id": 55,
                        "ingredientName": "Пшеничная мука"
                    },
                    "weight": 0.2
                },
                {
                    "ingredient": {
                        "id": 55,
                        "ingredientName": "Куриное яйцо"
                    },
                    "weight": 0.105
                },
                {
                    "ingredient": {
                        "id": 86,
                        "ingredientName": "Черный шоколад 70%-ный"
                    },
                    "weight": 0.25
                },
                {
                    "ingredient": {
                        "id": 86,
                        "ingredientName": "Черный шоколад 70%-ный"
                    },
                    "weight": 0.25
                },
                {
                    "ingredient": {
                        "id": 87,
                        "ingredientName": "Разрыхлитель"
                    },
                    "weight": 0.005
                }
            ]
        },
        {
            "id": 13,
            "recipeName": "Французские тосты с яблоками",
            "national": 4,
            "type": 7,
            "description": "Французские тосты с яблоками очень легко готовить своими руками. Они являются замечательным, очень вкусным и сытным завтраком. А также тосты подходят как простой и быстрый перекус в домашних условиях в течение дня.",
            "guide": "1. На топленом масле обжарить мелко нарезанное яблоко до мягкости, посыпать сахаром и корицей и жарить еще минуту, пока сахар не впитается в яблоки, а коричный аромат не пропитает все вокруг.\n2. Переложить яблоки в миску. Разрезать бриошь на половинки. ­Несильно взбить яйцо со сливками и щепоткой мускатного ореха.\n3. Вымочить в этой смеси половинки бриоши и обжарить их на той же сковороде, где жарились яблоки, до золотисто-­коричневой корочки. Это, соб­ственно, и будут французские тосты.\n4. Выложить на тосты обжаренные яблоки, посыпать сахарной пудрой, а в случае экстремальной любви к приятным запахам — еще и корицей.",
            "imagePath": "Images/tost",
            "cookingTime": 10,
            "ingredients": [
                {
                    "ingredient": {
                        "id": 46,
                        "ingredientName": "Топленое масло"
                    },
                    "weight": 0.05
                },
                {
                    "ingredient": {
                        "id": 37,
                        "ingredientName": "Сахар"
                    },
                    "weight": 0.005
                },
                {
                    "ingredient": {
                        "id": 30,
                        "ingredientName": "Куриное яйцо"
                    },
                    "weight": 0.04
                },
                {
                    "ingredient": {
                        "id": 43,
                        "ingredientName": "Сливки"
                    },
                    "weight": 0.05
                },
                {
                    "ingredient": {
                        "id": 43,
                        "ingredientName": "Сливки"
                    },
                    "weight": 0.05
                },
                {
                    "ingredient": {
                        "id": 88,
                        "ingredientName": "Яблоко"
                    },
                    "weight": 0.045
                },
                {
                    "ingredient": {
                        "id": 89,
                        "ingredientName": "Бриошь"
                    },
                    "weight": 0.02
                }
            ]
        },
        {
            "id": 14,
            "recipeName": "Удон с курицей",
            "national": 5,
            "type": 5,
            "description": "Лапша «удон» - это традиционная японская лапша, в состав которой входят пшеничная мука, вода и соль. Варится такая лапша очень быстро, в течение 5-7 минут после закипания воды. Да и само блюдо готовится очень быстро, так как курица и овощи обжариваются в сковороде вок на сильном огне.",
            "guide": "1. Сварить лапшу удон до готовности, следуя инструкции на упаковке, откинуть на дуршлаг и отставить в сторону. Фасоль, перец и кукурузу нарезать крупной соломкой, листья пак-чоя разрезать вдоль.\n2. Куриное филе нарезать небольшими кусочками и обжарить в глубокой сковородке на масле в течение примерно пяти минут до готовности. Добавить в сковороду все овощи, кроме пак-чоя, и хорошенько обжарить на сильном огне, помешивая, около трех минут.\n3. Добавить к курице и овощам готовую лапшу, перемешать и теперь уже положить в сковороду пак-чой. Влить устричный соус, снова аккуратно перемешать, стараясь не превратить все в кашу, и затем добавить соевый. Подавать сразу же.",
            "imagePath": "Images/udon",
            "cookingTime": 25,
            "ingredients": [
                {
                    "ingredient": {
                        "id": 95,
                        "ingredientName": "Лапша удон"
                    },
                    "weight": 0.6
                },
                {
                    "ingredient": {
                        "id": 66,
                        "ingredientName": "Куриное филе"
                    },
                    "weight": 0.5
                },
                {
                    "ingredient": {
                        "id": 68,
                        "ingredientName": "Сладкий перец"
                    },
                    "weight": 0.3
                },
                {
                    "ingredient": {
                        "id": 90,
                        "ingredientName": "Стручковая фасоль"
                    },
                    "weight": 0.1
                },
                {
                    "ingredient": {
                        "id": 91,
                        "ingredientName": "Салат пак-чой"
                    },
                    "weight": 0.16
                },
                {
                    "ingredient": {
                        "id": 92,
                        "ingredientName": "Мини-кукуруза"
                    },
                    "weight": 0.1
                },
                {
                    "ingredient": {
                        "id": 93,
                        "ingredientName": "Ростки сои"
                    },
                    "weight": 0.06
                },
                {
                    "ingredient": {
                        "id": 44,
                        "ingredientName": "Масло подсолнечное"
                    },
                    "weight": 0.2
                },
                {
                    "ingredient": {
                        "id": 65,
                        "ingredientName": "Соевый соус"
                    },
                    "weight": 0.05
                },
                {
                    "ingredient": {
                        "id": 94,
                        "ingredientName": "Устричный соус"
                    },
                    "weight": 0.05
                }
            ]
        },
        {
            "id": 15,
            "recipeName": "Лимонные креветки со специями",
            "national": 6,
            "type": 12,
            "description": "Лимонные креветки станут отличным дополнением к застолью!",
            "guide": "1. Замороженные неочищенные креветки разложить по противню.\n2. В блендере взбить до получения однородной консистенции сливочное масло, чеснок, зелень базилика, розмарин, сок лимона.\n3. На каждую креветку выложить немного сливочно-чесночной смеси. Держать в духовке около 30 минут при температуре 160 градусов. Выложить креветки на блюдо и полить соком, оставшимся на противне.",
            "imagePath": "Images/krevetki",
            "cookingTime": 30,
            "ingredients": [
                {
                    "ingredient": {
                        "id": 97,
                        "ingredientName": "Замороженные креветки"
                    },
                    "weight": 0.4
                },
                {
                    "ingredient": {
                        "id": 46,
                        "ingredientName": "Сливочное масло"
                    },
                    "weight": 0.4
                },
                {
                    "ingredient": {
                        "id": 72,
                        "ingredientName": "Лимонный сок"
                    },
                    "weight": 0.05
                },
                {
                    "ingredient": {
                        "id": 96,
                        "ingredientName": "Розмарин"
                    },
                    "weight": 0.025
                },
                {
                    "ingredient": {
                        "id": 31,
                        "ingredientName": "Базилик"
                    },
                    "weight": 0.025
                },
                {
                    "ingredient": {
                        "id": 22,
                        "ingredientName": "Чеснок"
                    },
                    "weight": 0.04
                }
            ]
        },
        {
            "id": 16,
            "recipeName": "Рисовая каша со сгущенкой",
            "national": 1,
            "type": 10,
            "description": "Кем-то любимая с детского сада, а кем-то вспоминаемая с недовольством, рисовая каша может и должна быть вкусной. Этот рецепт оценят любители сладкого — и особенно дети.",
            "guide": "1. В сотейнике смешать сливки с молоком и цедрой, снятой с половины апельсина. Стручок ванили разрезать вдоль, соскрести ножом внутренности и вместе со шкуркой бросить их в молоко со сливками.\n2. Довести до кипения, засыпать рис, уменьшить огонь и, периодически помешивая, варить до готовности (на это уйдет 15–18 минут). Помешивать обязательно, потому что рис иначе станет опускаться на дно и пригорать.\n3. Как только рис будет готов, вмешать сгущенное молоко, вытащить ваниль и снять с огня.\n4. Дать каше чуть остыть, положить кусочек сливочного масла, чуть перемешать и подавать. Сверху можно выложить дольки апельсина, очищенные от шкурки и пленок.",
            "imagePath": "Images/kasha",
            "cookingTime": 20,
            "ingredients": [
                {
                    "ingredient": {
                        "id": 10,
                        "ingredientName": "Рис"
                    },
                    "weight": 0.6
                },
                {
                    "ingredient": {
                        "id": 42,
                        "ingredientName": "Молоко"
                    },
                    "weight": 0.34
                },
                {
                    "ingredient": {
                        "id": 43,
                        "ingredientName": "Сливки"
                    },
                    "weight": 0.16
                },
                {
                    "ingredient": {
                        "id": 46,
                        "ingredientName": "Сливочное масло"
                    },
                    "weight": 0.04
                },
                {
                    "ingredient": {
                        "id": 98,
                        "ingredientName": "Сгущенное молоко"
                    },
                    "weight": 0.12
                },
                {
                    "ingredient": {
                        "id": 99,
                        "ingredientName": "Апельсин"
                    },
                    "weight": 0.08
                }
            ]
        }
    ]
}